3832 5498
3818 3836
2032 3208
3045 3162
1878 2752
2991 2673
3110 2571
1105 2448
107 2375
3383 2329
3133 1843
4596 1795
4659 1795
4614 1795
4686 1795
4695 1795
4677 1795
4623 1795
4605 1795
4632 1795
4668 1795
4578 1795
4641 1795
4650 1795
4704 1795
4713 1795
4587 1795
3251 1510
633 1419
1080 1360
2431 1217
3355 1188
1072 1186
4026 1105
2613 1105
1602 1103
1337 1064
2052 1022
4328 973
3403 970
3338 967
803 905
4597 898
4606 898
4615 898
4588 898
4570 898
4579 898
4651 898
4669 898
4696 898
4705 898
4678 898
4642 898
4687 898
4633 898
4624 898
4660 898
4610 897
4691 897
4697 897
4602 897
4612 897
4622 897
4630 897
4637 897
4658 897
4684 897
4698 897
4576 897
4645 897
4679 897
4657 897
4664 897
4674 897
4692 897
4709 897
4577 897
4586 897
4616 897
4620 897
4710 897
4656 897
4690 897
4688 897
4707 897
4685 897
4663 897
4706 897
4661 897
4702 897
4595 897
4601 897
4701 897
4625 897
4680 897
4635 897
4603 897
4644 897
4580 897
4600 897
4638 897
4607 897
4712 897
4591 897
4581 897
4589 897
4608 897
4648 897
4653 897
4583 897
4574 897
4631 897
4671 897
4666 897
4573 897
4626 897
4681 897
4703 897
4649 897
4655 897
4592 897
4604 897
4609 897
4665 897
4611 897
4594 897
4584 897
4575 897
4599 897
4582 897
4617 897
4627 897
4571 897
4613 897
4643 897
4700 897
4676 897
4639 897
4675 897
4673 897
4634 897
4590 897
4682 897
4618 897
4694 897
4572 897
4628 897
4640 897
4647 897
4708 897
4621 897
4670 897
4636 897
4646 897
4689 897
4672 897
4693 897
4699 897
4711 897
4654 897
4667 897
4629 897
4683 897
4619 897
4652 897
4662 897
4598 897
4585 897
4593 897
4039 870
765 867
3381 863
3333 861
3442 811
400 806
3825 801
2926 799
527 787
4193 756
1151 732
3186 712
1440 701
236 699
1940 694
2014 690
986 656
2013 655
1259 618
2320 605
2620 600
2944 578
4518 575
3446 575
3129 550
4070 548
1976 543
1703 542
2868 537
1326 522
706 514
3601 492
143 492
1748 491
3939 476
2895 475
3399 462
2534 459
2873 452
1881 449
1938 443
2493 441
2924 441
3406 438
3684 436
716 435
2854 430
21 420
1984 415
2632 413
2728 407
80 402
2703 398
2710 391
4118 390
2095 390
4283 390
4477 389
3232 388
2804 384
751 381
2681 379
2118 377
2835 374
979 370
4391 369
1885 368
4172 362
597 353
4535 351
3100 349
779 346
2422 345
3551 338
3293 334
3591 330
3647 326
3492 325
3718 321
4076 320
3020 318
311 316
3207 314
805 311
1684 299
2711 298
700 296
775 294
1755 293
3824 288
4423 286
559 284
504 284
3101 282
3975 281
2547 280
1830 277
2056 274
874 273
2719 272
4160 270
2190 270
648 269
2959 267
409 267
296 267
693 265
3678 265
1067 262
723 256
4355 254
2979 252
3104 252
1444 252
3670 250
2487 249
482 245
1960 243
1910 240
1296 240
2894 239
4173 237
448 237
4393 234
3504 228
2881 225
613 225
4479 223
1081 222
37 221
1005 219
631 217
2317 213
4320 213
3606 210
1685 208
4376 206
2424 205
3327 204
165 201
4287 201
640 198
1874 197
458 193
2371 193
1410 192
4203 191
336 190
66 186
4204 185
74 184
1038 184
2175 180
348 179
3134 178
1167 176
4490 172
1142 171
1145 171
3924 170
1416 170
3957 169
3650 169
806 168
2222 167
2960 166
1338 166
740 165
3268 164
2837 161
3917 158
698 158
1943 158
4512 157
4307 157
3135 157
4146 157
1871 156
831 154
2174 153
2087 151
4195 149
1246 148
2762 148
4259 147
2455 147
1052 146
373 146
3723 145
1734 144
935 140
3643 139
383 138
3755 138
2920 137
2177 136
2686 136
4049 135
3456 133
2700 132
3179 131
49 128
314 126
3001 125
3332 125
561 124
2796 124
3980 123
520 122
2859 121
1585 121
2262 120
2608 120
4378 119
1948 118
16 118
2746 117
4142 116
1865 115
3769 115
3040 115
2784 115
2623 114
1973 114
867 114
462 113
4514 113
4053 113
1449 113
1468 113
2782 112
653 111
3145 111
3297 109
4292 109
974 109
1421 109
2365 108
3518 108
4536 107
4147 106
2566 105
2936 104
2083 104
2670 102
2805 101
2276 101
137 100
494 100
3925 100
1530 100
3005 99
3244 98
1784 98
364 98
2919 97
3400 97
3833 97
4105 97
83 96
1958 96
3958 96
959 95
2720 94
3715 94
2158 93
2617 93
453 92
40 92
3140 91
35 91
1150 91
809 90
861 90
2208 90
1590 90
2519 89
1577 89
2198 89
4394 88
2338 88
1053 87
1332 87
2723 86
2347 86
1792 86
2200 86
4567 86
4240 85
4117 85
3253 84
3120 83
3688 83
2114 83
160 83
2761 82
4243 81
2586 81
3160 81
641 80
2578 80
459 80
3409 79
3916 79
2061 78
4097 78
1389 77
2475 77
1369 76
593 76
3320 75
697 75
2393 74
2803 74
193 74
1711 74
2294 74
456 74
2332 74
715 73
3056 73
2454 73
3078 73
524 72
3314 72
752 72
4234 72
3301 72
3584 71
2446 71
2518 71
1989 71
2787 71
216 71
2010 70
4298 70
4036 70
3144 70
709 70
3941 70
2001 70
1771 69
201 69
2192 68
4552 67
2559 67
4545 67
1404 67
2726 67
2535 66
166 66
1029 66
1057 65
3822 65
2216 65
78 65
4417 64
3682 64
4500 64
154 63
564 63
3875 63
2802 63
69 63
919 63
2202 62
1499 62
1706 61
393 61
1534 61
3908 61
226 60
4174 60
4390 60
1076 60
1219 60
3246 60
794 60
4465 59
2256 59
4504 59
2167 59
699 59
1743 58
3771 58
3017 58
97 58
3553 58
2520 58
2112 58
2701 58
3272 57
3410 57
318 57
2826 57
609 57
4336 57
3652 57
659 57
3006 57
1524 57
3170 57
307 57
2597 56
3352 56
3529 56
2864 56
502 56
2899 55
856 55
2785 55
48 54
1177 54
1170 54
472 54
4530 54
928 54
4470 54
1073 54
1679 54
3995 54
681 53
1186 53
3876 53
1234 53
2415 53
3462 53
964 53
3395 52
1769 52
343 52
753 52
1870 51
4223 51
1172 51
1399 51
145 51
4538 51
4254 51
823 51
2385 51
430 50
2122 50
2445 50
2377 50
1383 50
310 49
2306 49
3687 49
146 48
355 48
1609 48
1712 48
3437 48
4130 47
3726 47
2937 47
1233 47
796 47
2155 47
2360 47
2647 47
4454 47
2594 47
3079 47
4323 47
110 46
3538 46
4462 46
2038 46
4511 46
4354 46
2172 45
2789 45
2383 45
3426 45
1213 45
1451 45
2263 45
1481 45
2374 44
2992 44
578 44
2019 44
3255 44
1200 44
4220 44
4493 44
568 44
1083 43
1446 43
2529 43
761 43
942 42
3641 42
4533 42
1155 42
113 42
2035 42
1532 42
3910 42
1920 42
227 42
186 42
3636 42
2440 42
4233 42
2409 42
2797 42
4024 42
3236 42
1839 41
3866 41
10 41
2490 41
4458 41
92 41
1017 41
369 41
1211 41
1056 41
1835 41
4270 41
4151 41
13 40
2775 40
1918 40
2150 40
1977 40
3814 40
3871 40
1097 39
4401 39
901 39
4099 39
632 39
70 39
1651 39
4115 39
2552 39
1175 39
804 39
1128 39
2215 39
3720 38
406 38
3473 38
509 38
100 38
2187 38
3048 38
2242 38
2657 38
1044 38
4339 38
3743 38
1157 38
1217 38
2633 37
865 37
4257 37
2003 37
2740 37
3139 37
128 37
2364 37
4209 37
204 37
2823 37
1216 37
3846 36
2323 36
2466 36
825 36
4444 36
4335 36
3024 36
882 36
4515 36
329 36
168 36
1942 36
1333 36
2063 35
4289 35
2962 35
4126 35
560 35
3734 35
2865 35
2343 35
3444 35
2715 35
658 35
4261 34
1049 34
2162 34
1322 34
112 34
3511 34
2885 34
3618 34
125 34
676 34
2160 34
2824 34
2337 34
3183 34
2771 34
2345 33
394 33
3938 33
225 33
4075 33
2185 33
2752 33
1718 33
923 33
2672 33
3865 33
1092 33
886 33
3921 33
1831 33
763 32
516 32
3241 32
718 32
1893 32
1107 32
3034 32
3749 32
3469 32
1031 32
3617 32
3500 32
3360 32
3128 32
4045 32
2348 32
2934 31
2040 31
2004 31
4409 31
773 31
3523 31
3581 31
2381 31
2982 31
1241 31
1982 31
1124 31
512 31
4062 31
3549 31
1371 31
4094 30
3295 30
1617 30
397 30
3431 30
4002 30
2142 30
4102 30
3821 30
991 30
24 30
649 30
2791 30
8 30
1974 30
3335 30
1188 29
2807 29
3149 29
1340 29
2325 29
2423 29
3671 29
1735 29
720 29
866 29
2008 29
3083 29
3748 29
3937 29
3270 29
3342 29
2558 28
3258 28
3124 28
1533 28
902 28
1099 28
2579 28
3604 28
789 28
4565 28
2953 28
1556 28
2277 28
2870 28
3274 28
1593 27
148 27
3389 27
3524 27
797 27
57 27
2893 27
3298 27
1001 27
507 27
1501 27
323 27
2154 27
2125 27
2662 27
404 27
1929 27
1588 27
4312 27
3354 27
1528 26
3013 26
2833 26
3790 26
3367 26
1078 26
4050 26
596 26
4501 26
3565 26
4440 26
3127 26
2648 26
2 26
3934 26
3369 26
219 26
2146 26
1853 26
2698 26
1033 26
811 26
3248 26
1605 26
1435 25
2987 25
4553 25
1955 25
1546 25
1201 25
3981 25
2217 25
1100 25
2145 25
1543 25
4212 25
2357 24
2163 24
3343 24
1875 24
2781 24
3095 24
248 24
3776 24
517 24
1409 24
2196 24
350 24
3047 24
4499 24
1783 24
1525 24
3897 24
1134 24
2005 24
1629 24
2887 24
1488 24
3493 24
566 24
2100 23
41 23
101 23
2105 23
3683 23
45 23
4044 23
1385 23
4121 23
29 23
1661 23
3331 23
4413 23
63 23
600 23
2430 23
202 23
4196 23
371 23
862 23
2266 23
3044 23
2388 23
4031 23
4135 23
3992 23
1125 23
1596 23
3820 23
4351 23
1641 22
68 22
2981 22
3895 22
3996 22
3027 22
769 22
2065 22
1250 22
4106 22
2411 22
2248 22
2713 22
563 22
3402 22
2111 22
3099 22
2603 22
2442 22
3164 22
1861 22
1119 22
816 22
3032 22
1796 21
2460 21
4055 21
1015 21
425 21
1970 21
1327 21
1372 21
1412 21
3315 21
666 21
4013 21
416 21
2230 21
4145 21
1559 21
4367 21
1305 21
1277 21
1678 21
4267 21
1189 21
3519 21
2197 21
2427 21
2447 21
211 21
293 21
4375 21
1966 21
349 20
894 20
4352 20
1992 20
3072 20
1354 20
1587 20
3735 20
2326 20
2047 20
2706 20
4087 20
279 20
3622 20
930 20
601 20
927 20
537 20
3499 20
1342 20
3067 20
467 20
3599 20
3049 20
3752 20
268 20
3867 20
654 20
3972 20
4262 20
4520 20
741 20
3137 20
1131 20
1487 20
3885 20
151 20
4176 20
2669 20
1041 20
71 20
3291 20
2051 20
2717 20
3256 20
126 20
1610 19
2724 19
1548 19
571 19
586 19
3985 19
1801 19
4457 19
3990 19
1197 19
3358 19
1787 19
1039 19
1817 19
889 19
2060 19
4019 19
691 19
1843 19
352 19
837 19
3841 19
3185 19
1856 19
903 19
605 19
3339 19
2036 19
2031 19
1826 19
1514 19
2624 18
3747 18
4260 18
374 18
3626 18
1931 18
4250 18
3487 18
544 18
3812 18
4107 18
612 18
1959 18
3672 18
977 18
1813 18
2948 18
1521 18
877 18
1957 18
3838 18
2201 18
4327 18
3454 18
1892 18
342 18
26 18
548 18
2127 18
674 18
4448 18
2498 18
1764 18
2206 18
1599 18
2086 18
3008 18
3408 18
4127 18
438 18
2220 18
1566 17
1854 17
1110 17
2299 17
4154 17
3665 17
177 17
2744 17
1312 17
2596 17
4137 17
3911 17
1686 17
2650 17
3878 17
3210 17
122 17
4368 17
3915 17
2480 17
958 17
2027 17
1221 17
3965 17
2690 17
139 17
1294 17
2405 17
1724 17
1809 17
795 17
224 17
833 17
3701 17
3977 17
2227 17
1341 17
1833 17
3717 17
1923 17
4285 17
1061 17
3200 17
77 17
3109 17
3014 17
3827 17
3087 17
85 17
405 17
469 17
1527 17
518 17
2834 17
3425 17
853 17
2465 17
302 17
2287 17
1980 17
2352 17
3874 17
1360 17
931 17
3571 17
2673 17
4356 17
3787 16
557 16
4150 16
3919 16
3900 16
3608 16
1851 16
3247 16
4201 16
2426 16
2872 16
3515 16
2346 16
1699 16
178 16
2716 16
2537 16
4524 16
3837 16
2584 16
1418 16
4319 16
2910 16
3831 16
4371 16
2523 16
3628 16
3222 16
1693 16
665 16
58 16
412 16
1924 16
244 16
33 16
4014 16
257 16
290 16
660 16
2821 16
663 16
1751 16
1723 16
3530 16
4329 16
3751 16
2729 16
4410 16
2384 16
1719 16
4103 15
263 15
1933 15
265 15
1425 15
519 15
2939 15
747 15
1807 15
2685 15
2166 15
455 15
4095 15
281 15
4418 15
2368 15
2131 15
508 15
4434 15
4379 15
1646 15
2915 15
4385 15
1539 15
2542 15
3843 15
2602 15
4238 15
565 15
354 15
2441 15
3243 15
3926 15
526 15
3761 15
1710 15
3068 15
3894 15
646 15
1584 15
422 15
3307 15
2536 15
2135 15
1423 15
731 15
3350 15
1470 15
4461 15
138 15
1209 15
475 15
163 15
1251 15
3061 15
1051 15
473 15
898 15
3158 15
4037 15
108 15
285 15
620 15
2090 15
200 15
3555 15
750 15
1205 14
3447 14
2199 14
4529 14
1009 14
939 14
1103 14
3299 14
694 14
1676 14
2130 14
491 14
2243 14
4544 14
291 14
2730 14
2513 14
493 14
3123 14
4012 14
2359 14
592 14
3260 14
2223 14
729 14
124 14
2193 14
98 14
880 14
2768 14
4505 14
2996 14
3945 14
841 14
1062 14
1139 14
2678 14
3697 14
191 14
2812 14
3614 14
2951 14
3979 14
51 14
1291 14
2336 14
2236 14
4022 14
328 14
308 14
1709 14
3654 14
1168 14
3646 14
440 14
356 14
845 14
1744 14
3364 14
3810 14
1634 14
2251 14
2234 14
1793 14
2646 14
3930 14
106 14
4190 14
3963 14
2120 14
724 14
3483 14
1580 14
1098 14
4377 14
3147 14
142 14
498 14
3799 14
175 14
590 14
2815 14
2322 14
4463 14
3184 14
3573 14
2900 14
2891 14
395 14
722 14
1222 14
1261 13
888 13
2301 13
912 13
3681 13
2641 13
3118 13
1639 13
4365 13
2141 13
1455 13
3580 13
2267 13
67 13
3203 13
2349 13
998 13
1594 13
735 13
4427 13
3931 13
2169 13
3411 13
4301 13
1106 13
4152 13
932 13
429 13
1065 13
185 13
570 13
4304 13
386 13
943 13
3633 13
3007 13
2736 13
322 13
2848 13
1130 13
1063 13
1127 13
3322 13
4263 13
2965 13
3182 13
827 13
1518 13
2182 13
4441 13
1728 13
61 13
1419 13
1184 13
2589 13
197 13
2533 13
4208 13
256 13
3329 13
283 13
4485 13
3572 13
3907 13
1516 13
1683 13
670 13
264 13
1766 13
1025 13
1702 13
3452 13
3037 13
3438 13
614 13
2179 13
2126 13
2813 13
3782 13
254 13
2604 13
1016 13
1665 13
913 13
3568 13
4321 13
2614 13
607 12
3033 12
3114 12
2645 12
3218 12
1741 12
783 12
2106 12
56 12
1877 12
340 12
3361 12
3391 12
671 12
3800 12
1310 12
5 12
3163 12
4389 12
1236 12
2476 12
2436 12
362 12
3727 12
4214 12
1653 12
3547 12
1000 12
555 12
1732 12
2932 12
1978 12
4358 12
4311 12
1148 12
993 12
1996 12
846 12
2779 12
3756 12
1569 12
4077 12
117 12
1108 12
1269 12
1381 12
4337 12
3237 12
1526 12
1242 12
1180 12
3266 12
4081 12
3197 12
4406 12
1731 12
3968 12
2207 12
3613 12
2334 12
271 12
2940 12
4018 12
1459 12
579 12
288 12
3433 12
2695 12
2073 12
3887 12
937 12
921 12
3585 12
3554 12
2541 12
1495 12
2307 12
1654 12
4035 12
1218 12
4120 12
617 12
2292 12
685 12
3862 12
925 12
1101 12
2023 12
3694 12
733 12
2914 12
2330 12
920 11
4136 11
4015 11
3882 11
141 11
2315 11
3215 11
2020 11
1640 11
3964 11
1087 11
3903 11
1876 11
4555 11
1717 11
3059 11
454 11
1022 11
2249 11
1027 11
3883 11
2999 11
949 11
2464 11
1126 11
1968 11
2525 11
748 11
734 11
1275 11
3214 11
2183 11
3136 11
81 11
1552 11
4167 11
798 11
2439 11
3728 11
3852 11
2018 11
988 11
14 11
1808 11
2590 11
591 11
1387 11
258 11
4562 11
1715 11
3094 11
1505 11
3385 11
3804 11
4202 11
3642 11
3356 11
3142 11
3016 11
3616 11
4435 11
3220 11
850 11
506 11
1010 11
996 11
1239 11
4436 11
1070 11
4399 11
3725 11
2808 11
3805 11
1160 11
3594 11
4189 11
3071 11
4056 11
4445 11
3432 11
2096 11
869 11
3138 11
1405 11
3371 11
3476 11
2832 11
4112 11
3175 11
2619 11
3610 11
4487 11
4139 11
2354 11
2043 11
4430 11
3303 11
3388 11
3461 11
36 11
2437 11
4258 11
916 11
1345 11
2966 11
420 11
1635 11
1346 11
3861 11
3948 11
2469 11
2264 11
1289 11
1790 11
572 11
4242 11
2993 11
1096 11
1750 10
826 10
4020 10
3148 10
1606 10
1811 10
1804 10
3108 10
3922 10
629 10
3730 10
2144 10
4316 10
2514 10
2438 10
2133 10
1036 10
2059 10
2369 10
2254 10
2917 10
3198 10
551 10
1493 10
2765 10
367 10
1689 10
1586 10
303 10
2974 10
1437 10
1905 10
9 10
3901 10
3401 10
3722 10
1888 10
111 10
4431 10
23 10
1454 10
1475 10
1987 10
411 10
3510 10
2675 10
2661 10
956 10
2725 10
1956 10
1406 10
3702 10
4241 10
2404 10
2161 10
3891 10
3558 10
1645 10
2816 10
1452 10
385 10
2288 10
577 10
4251 10
1531 10
1649 10
1035 10
365 10
4164 10
2453 10
4349 10
546 10
4540 10
1627 10
1810 10
1729 10
3382 10
1914 10
3653 10
947 10
3889 10
1733 10
875 10
757 10
4191 10
4088 10
3289 10
363 10
2580 10
2699 10
4179 10
4074 10
971 10
1993 10
1193 10
2255 10
2581 10
289 10
3870 10
2770 10
981 10
1550 10
933 10
54 10
2544 10
2136 10
3603 10
4362 10
1090 10
1642 10
2649 10
43 10
1486 10
2391 10
941 10
2538 10
2606 10
1431 10
1658 10
3710 10
3002 10
819 10
4276 9
2188 9
1696 9
3224 9
730 9
497 9
3577 9
1775 9
4104 9
3973 9
1149 9
1003 9
1774 9
207 9
382 9
2361 9
999 9
945 9
714 9
474 9
4528 9
2461 9
885 9
4350 9
2443 9
692 9
485 9
530 9
237 9
3639 9
4143 9
3994 9
636 9
1519 9
2712 9
2044 9
299 9
1846 9
2628 9
787 9
1503 9
1921 9
3561 9
209 9
3475 9
337 9
3505 9
4388 9
44 9
1482 9
4177 9
2585 9
2778 9
1776 9
2241 9
410 9
1705 9
4184 9
4433 9
2413 9
4326 9
2682 9
3470 9
3552 9
2907 9
2769 9
4224 9
2218 9
2355 9
2094 9
3404 9
4032 9
1722 9
4161 9
3460 9
2829 9
2140 9
1866 9
3570 9
515 9
3025 9
3826 9
277 9
695 9
4027 9
1074 9
1112 9
4009 9
1043 9
4058 9
4246 9
4516 9
746 9
4282 9
908 9
2961 9
588 9
3039 9
1557 9
1727 9
784 9
2260 9
3089 9
1198 9
4532 9
3376 9
599 9
1243 9
793 9
500 9
476 9
2692 9
2738 9
584 9
3658 9
3940 9
2022 9
2203 9
1045 9
3655 9
2057 9
1367 9
3374 9
4340 9
1542 9
392 9
1461 9
1598 9
3999 9
1228 9
2395 9
240 9
2491 9
580 9
1030 9
602 9
2481 9
4432 9
3171 9
3835 9
273 9
3656 9
1034 9
4308 9
4098 9
234 9
906 9
2123 9
3405 9
1489 9
452 9
3019 9
403 9
2195 9
3619 9
4403 9
3807 9
852 9
4235 9
3823 9
1794 9
4236 9
2472 9
1324 9
2302 9
3503 9
1227 9
2002 8
2467 8
1597 8
667 8
800 8
703 8
2696 8
4079 8
4211 8
2869 8
1013 8
4537 8
3267 8
1473 8
3228 8
4200 8
1555 8
1571 8
1393 8
3526 8
2748 8
628 8
1925 8
1644 8
3156 8
2304 8
3956 8
3445 8
992 8
228 8
1272 8
2289 8
2626 8
1692 8
4564 8
1737 8
2688 8
1620 8
967 8
176 8
3592 8
183 8
466 8
4269 8
1740 8
3753 8
1768 8
3522 8
4332 8
2290 8
2134 8
1752 8
461 8
3193 8
495 8
3187 8
3152 8
169 8
1916 8
2244 8
140 8
4206 8
1630 8
807 8
2654 8
2958 8
2946 8
1374 8
4025 8
1347 8
870 8
4085 8
1954 8
1166 8
2844 8
1623 8
1476 8
4279 8
2350 8
1601 8
4353 8
2028 8
1439 8
347 8
3271 8
743 8
644 8
3453 8
2809 8
1716 8
2189 8
2923 8
2007 8
449 8
4156 8
3415 8
3085 8
3863 8
1411 8
1434 8
4068 8
635 8
3192 8
2176 8
2556 8
1510 8
4229 8
651 8
2983 8
1 8
2642 8
2527 8
1055 8
3765 8
3525 8
2846 8
2006 8
3154 8
3204 8
42 8
1749 8
249 8
4280 8
1753 8
2209 8
1190 8
3081 8
533 8
2878 8
2591 8
3416 8
1064 8
3178 8
2091 8
1443 8
0 8
1765 8
1491 8
702 8
2643 8
4395 8
2214 8
1086 8
156 8
4333 8
3764 8
4383 8
3927 8
1799 8
3840 8
3052 8
12 8
1144 8
3605 8
1523 8
1889 8
2402 8
2344 8
2399 8
1095 8
3174 8
4324 8
2164 8
3390 8
2303 8
1857 8
556 8
2664 8
3264 8
1161 8
2792 8
4187 8
2938 8
3974 8
710 8
2565 8
1075 8
2908 8
1995 8
2034 7
1079 7
1084 7
3744 7
1855 7
2311 7
1860 7
91 7
4063 7
4005 7
127 7
431 7
2886 7
4059 7
1146 7
3263 7
2799 7
4526 7
2731 7
2764 7
3422 7
260 7
1816 7
3778 7
4016 7
549 7
682 7
415 7
3481 7
221 7
1019 7
984 7
1829 7
1567 7
89 7
3029 7
4165 7
1545 7
428 7
2382 7
832 7
987 7
121 7
759 7
3497 7
647 7
150 7
2639 7
4560 7
1663 7
3309 7
2976 7
3773 7
2486 7
2847 7
3691 7
381 7
2774 7
1934 7
2986 7
3858 7
499 7
3150 7
3952 7
1671 7
4557 7
893 7
2272 7
2281 7
995 7
136 7
2830 7
868 7
3119 7
978 7
890 7
4468 7
1666 7
3637 7
2630 7
3213 7
3427 7
3847 7
732 7
32 7
755 7
2707 7
4197 7
2011 7
2274 7
622 7
3777 7
2757 7
585 7
18 7
737 7
2843 7
3112 7
1701 7
1779 7
3893 7
188 7
3803 7
155 7
4364 7
3472 7
2861 7
2925 7
1438 7
3991 7
2494 7
911 7
1422 7
2882 7
2390 7
3856 7
3918 7
4347 7
1884 7
3797 7
4325 7
4083 7
2168 7
39 7
3351 7
1591 7
2143 7
1147 7
3485 7
3731 7
2093 7
2257 7
1232 7
1485 7
4370 7
4503 7
1442 7
1288 7
2033 7
2977 7
603 7
390 7
341 7
2012 7
679 7
3060 7
3724 7
3206 7
3018 7
3434 7
3287 7
4396 7
2857 7
2305 7
1827 7
208 7
3685 7
1325 7
4405 7
4382 7
2238 7
3533 7
1747 7
558 7
1158 7
2763 7
2420 7
426 7
1152 7
4343 7
2666 7
3070 7
3513 7
3482 7
808 7
2282 7
2138 7
2683 7
4507 7
2853 7
1512 7
4138 7
3265 7
4207 7
3231 7
2877 7
408 7
2572 7
2329 7
3516 7
2512 7
1460 7
1066 7
3912 7
3729 7
4450 7
618 7
206 6
253 6
1368 6
582 6
2237 6
292 6
3088 6
2660 6
1059 6
4315 6
2735 6
2229 6
3784 6
664 6
2500 6
3935 6
4188 6
1427 6
2313 6
3257 6
4452 6
3987 6
4558 6
2553 6
3789 6
1185 6
3971 6
3063 6
1695 6
3959 6
320 6
1507 6
4252 6
3560 6
4218 6
2398 6
3779 6
3294 6
1777 6
3767 6
3259 6
3365 6
3942 6
427 6
662 6
2858 6
2178 6
3023 6
4006 6
532 6
2605 6
3146 6
4245 6
1763 6
2448 6
2081 6
4416 6
3363 6
3541 6
3245 6
4215 6
1896 6
878 6
562 6
2989 6
2635 6
2975 6
2814 6
1529 6
1802 6
1759 6
3010 6
3578 6
88 6
884 6
3387 6
3323 6
4342 6
120 6
4309 6
2732 6
742 6
1659 6
2245 6
4341 6
3418 6
443 6
2860 6
3277 6
1224 6
3595 6
2053 6
1365 6
3249 6
2929 6
2631 6
1316 6
2089 6
1981 6
3537 6
3598 6
2066 6
4028 6
172 6
3082 6
129 6
3279 6
3375 6
4317 6
972 6
3543 6
1589 6
2104 6
1359 6
2024 6
3589 6
1770 6
2506 6
1335 6
4141 6
309 6
3414 6
683 6
4092 6
4123 6
1863 6
1852 6
3817 6
1953 6
3285 6
1109 6
1141 6
2817 6
2319 6
3627 6
3933 6
2483 6
2321 6
3860 6
2452 6
280 6
3944 6
1390 6
241 6
189 6
1204 6
153 6
3562 6
4303 6
3317 6
3495 6
3853 6
86 6
1967 6
1002 6
1506 6
1490 6
2598 6
3107 6
3380 6
1909 6
1328 6
62 6
1535 6
3181 6
3092 6
2852 6
4043 6
719 6
3474 6
1540 6
3602 6
3269 6
1018 6
2655 6
3022 6
771 6
3262 6
854 6
547 6
4231 6
3180 6
1375 6
3448 6
3093 6
4153 6
1951 6
3230 6
3531 6
3559 6
132 6
3669 6
3854 6
1247 6
4065 6
4476 6
4249 6
4226 6
2367 6
3216 6
2457 6
344 6
3586 6
3587 6
678 6
762 6
3283 6
3768 6
3698 6
3651 6
4293 6
4116 6
767 6
4449 6
569 6
2076 6
1308 6
1664 6
1208 6
1260 6
2636 6
968 6
3943 6
3125 6
2471 6
3690 6
3239 6
3638 6
1622 6
2618 6
3905 6
3004 6
4369 6
2691 6
4181 6
2314 6
275 6
2479 6
4517 6
1414 6
357 6
2298 6
4384 5
4539 5
1273 5
3311 5
652 5
319 5
3896 5
4491 5
2611 5
3961 5
212 5
2153 5
1163 5
2231 5
3791 5
4459 5
3534 5
1883 5
4563 5
1513 5
238 5
1845 5
76 5
460 5
3319 5
4456 5
2488 5
96 5
2575 5
4124 5
4359 5
1478 5
1511 5
1343 5
267 5
2075 5
2366 5
353 5
3966 5
3394 5
3808 5
3103 5
2425 5
3113 5
1818 5
1339 5
4373 5
239 5
1868 5
335 5
1697 5
2530 5
11 5
2082 5
1760 5
717 5
1355 5
1138 5
1264 5
2474 5
164 5
4248 5
72 5
3542 5
2825 5
2820 5
2949 5
82 5
345 5
3732 5
1650 5
424 5
4244 5
447 5
538 5
4048 5
650 5
3340 5
2972 5
552 5
3430 5
2482 5
2049 5
4054 5
3576 5
27 5
278 5
2273 5
727 5
1366 5
2818 5
3386 5
1848 5
3486 5
863 5
2221 5
1869 5
4402 5
2758 5
2497 5
2392 5
297 5
2980 5
711 5
3233 5
1477 5
3762 5
859 5
1700 5
2583 5
346 5
4071 5
2270 5
1329 5
259 5
380 5
304 5
1462 5
2310 5
536 5
1028 5
1864 5
3795 5
3742 5
2372 5
1192 5
969 5
1778 5
1551 5
997 5
377 5
3373 5
2750 5
3412 5
897 5
1295 5
2637 5
4380 5
1348 5
3003 5
2041 5
2609 5
980 5
604 5
3292 5
1357 5
4060 5
940 5
1754 5
899 5
4527 5
4061 5
3884 5
4300 5
1572 5
3 5
4017 5
2968 5
95 5
989 5
2741 5
2526 5
3282 5
3869 5
2478 5
2173 5
3998 5
4133 5
22 5
4467 5
1583 5
1652 5
4288 5
2128 5
3741 5
3348 5
3949 5
1417 5
3635 5
3611 5
3368 5
182 5
3011 5
3310 5
3609 5
1688 5
2309 5
1082 5
387 5
1862 5
17 5
2376 5
3792 5
366 5
287 5
3096 5
2253 5
3471 5
1162 5
785 5
2484 5
1114 5
2969 5
3396 5
6 5
3359 5
2433 5
3090 5
2811 5
3212 5
2601 5
2407 5
2170 5
4148 5
4064 5
4344 5
3794 5
776 5
3645 5
1891 5
1299 5
3021 5
1614 5
3675 5
2840 5
756 5
3754 5
1093 5
1721 5
3328 5
4439 5
3304 5
944 5
313 5
3286 5
2507 5
170 5
4404 5
3815 5
2622 5
1225 5
966 5
1979 5
3321 5
1361 5
3162 5
3607 5
4305 5
3208 5
4447 5
3423 5
3757 5
3736 5
2918 5
4486 5
2429 5
4186 5
1773 5
2874 5
2037 5
531 5
487 5
1939 5
994 5
3491 5
1364 5
2444 5
2340 5
1913 5
1024 5
1088 5
483 5
4397 5
4310 5
3161 5
1726 5
778 5
774 5
1739 5
1926 5
3084 5
4093 5
2866 5
4192 5
2876 5
1720 5
1814 5
2571 5
1935 5
3920 5
3201 5
1509 5
1450 5
4256 5
3898 5
4166 5
360 5
4400 5
610 5
1972 5
2577 5
2931 5
705 5
2293 5
2025 5
1453 5
2718 5
3439 5
3372 5
1164 4
1137 4
1020 4
2930 4
847 4
2501 4
3575 4
3502 4
2333 4
2941 4
574 4
3673 4
2942 4
2157 4
1199 4
3349 4
1736 4
1694 4
4111 4
876 4
1094 4
4314 4
3970 4
1315 4
1638 4
1292 4
1276 4
1964 4
3763 4
3661 4
1858 4
1691 4
4216 4
75 4
1037 4
417 4
3967 4
4129 4
130 4
1229 4
118 4
3955 4
1786 4
4407 4
2069 4
2737 4
3566 4
2570 4
147 4
2147 4
2079 4
73 4
339 4
1136 4
3906 4
990 4
4374 4
276 4
936 4
3151 4
1660 4
3077 4
1907 4
1202 4
3574 4
3904 4
3680 4
905 4
1761 4
3664 4
3012 4
3122 4
1047 4
1517 4
1311 4
3466 4
1655 4
1319 4
3859 4
1048 4
2760 4
3238 4
2567 4
1936 4
2898 4
1952 4
1373 4
1388 4
3278 4
4531 4
2903 4
4199 4
1135 4
946 4
2387 4
3428 4
4428 4
1667 4
3705 4
131 4
3528 4
2451 4
3467 4
2509 4
379 4
768 4
4040 4
1898 4
673 4
799 4
1257 4
1564 4
3496 4
3221 4
133 4
2416 4
1668 4
3030 4
3997 4
1281 4
2702 4
2554 4
3290 4
2851 4
4029 4
2121 4
1420 4
656 4
1301 4
2228 4
1479 4
848 4
217 4
1344 4
3457 4
2911 4
2212 4
1377 4
3296 4
28 4
929 4
1844 4
274 4
1937 4
2070 4
1690 4
4046 4
3582 4
638 4
1457 4
3105 4
3809 4
3413 4
1483 4
471 4
2058 4
2667 4
976 4
739 4
2318 4
4205 4
4078 4
2749 4
3046 4
4090 4
496 4
3325 4
1656 4
391 4
2839 4
830 4
728 4
4361 4
2456 4
3053 4
1376 4
3276 4
2687 4
2180 4
2863 4
3280 4
1323 4
983 4
3169 4
3695 4
669 4
1302 4
4198 4
2599 4
1252 4
2560 4
4089 4
780 4
1494 4
2776 4
3429 4
1307 4
1565 4
1226 4
2152 4
2394 4
540 4
2880 4
3716 4
2549 4
2226 4
1173 4
2205 4
3288 4
3357 4
915 4
3774 4
2734 4
4277 4
725 4
1515 4
3172 4
2258 4
2819 4
330 4
4453 4
2353 4
3624 4
934 4
4551 4
1432 4
758 4
4168 4
2362 4
1286 4
3242 4
1742 4
2250 4
2492 4
3839 4
3227 4
3308 4
1946 4
3106 4
3490 4
2029 4
1825 4
2615 4
181 4
2327 4
3928 4
269 4
3131 4
2240 4
3366 4
192 4
534 4
1897 4
2990 4
1822 4
1782 4
3689 4
1998 4
3969 4
305 4
1762 4
3540 4
1058 4
3892 4
738 4
4128 4
1298 4
2945 4
621 4
3379 4
1932 4
3455 4
135 4
46 4
439 4
4569 4
4180 4
2279 4
4566 4
1428 4
3028 4
2548 4
3306 4
3330 4
1988 4
2358 4
1625 4
2952 4
1270 4
2107 4
223 4
2295 4
1118 4
4387 4
2600 4
372 4
1573 4
4446 4
1836 4
423 4
489 4
3662 4
824 4
4547 4
2772 4
1806 4
1466 4
1071 4
843 4
1682 4
1050 4
3679 4
1890 4
4007 4
1456 4
2071 4
3117 4
782 4
4175 4
3657 4
2259 4
4132 4
2342 4
1021 4
2616 4
962 4
1949 4
1254 4
1961 4
541 4
457 4
243 4
864 4
4302 4
210 4
1669 4
744 4
2252 4
3713 4
4003 4
4297 4
567 4
4134 4
30 4
3711 4
1403 4
1643 4
514 4
2401 4
1904 4
1600 4
1522 4
3850 4
575 4
4051 4
2510 4
2261 4
1882 4
3579 4
1077 4
1824 4
213 4
3849 4
1788 4
1235 4
3913 4
696 4
1331 4
1537 4
1472 4
4478 4
1187 4
2225 4
4299 4
1850 4
3696 4
2213 4
3064 4
4108 4
2755 4
4011 4
821 4
1363 4
2810 4
1603 4
2697 4
707 4
1674 4
2363 4
3932 4
242 4
1492 4
4170 4
421 4
625 4
619 4
1812 4
2950 4
3015 4
4182 4
4057 4
1215 4
955 4
1847 3
4033 3
2970 3
3344 3
4330 3
2721 3
643 3
985 3
4464 3
2956 3
1183 3
4475 3
677 3
3051 3
1426 3
2904 3
3951 3
1313 3
2389 3
2629 3
1230 3
2235 3
529 3
1911 3
1708 3
3494 3
917 3
465 3
1362 3
1370 3
2297 3
2841 3
3223 3
2849 3
543 3
1271 3
2316 3
1351 3
963 3
2380 3
2532 3
657 3
2621 3
1330 3
2684 3
4162 3
3550 3
1445 3
2985 3
3211 3
1595 3
1011 3
4144 3
4266 3
525 3
1413 3
4366 3
1111 3
4228 3
444 3
2871 3
2499 3
2078 3
205 3
3557 3
1999 3
2625 3
1231 3
4425 3
892 3
2984 3
1730 3
2030 3
4194 3
109 3
4041 3
2795 3
3062 3
1353 3
1758 3
1279 3
1380 3
419 3
2450 3
1132 3
2265 3
1392 3
686 3
3766 3
3478 3
3816 3
1673 3
1900 3
1441 3
4281 3
3829 3
1300 3
817 3
1561 3
1498 3
1262 3
4345 3
1122 3
3649 3
982 3
1930 3
4021 3
1408 3
513 3
3091 3
3888 3
4140 3
3229 3
4119 3
1165 3
1675 3
321 3
3194 3
4561 3
3620 3
2722 3
883 3
1991 3
152 3
3126 3
316 3
1102 3
521 3
581 3
829 3
2935 3
396 3
2933 3
1922 3
1467 3
2780 3
2397 3
3217 3
173 3
4247 3
3634 3
772 3
2921 3
1618 3
3393 3
1611 3
1156 3
812 3
2773 3
1899 3
1436 3
2039 3
3600 3
3441 3
1203 3
3155 3
1176 3
2704 3
1026 3
3132 3
4253 3
1220 3
351 3
4415 3
233 3
1336 3
231 3
4159 3
1756 3
1616 3
881 3
1837 3
4023 3
3659 3
2233 3
1867 3
4525 3
2524 3
4237 3
818 3
3660 3
2508 3
3384 3
2171 3
4414 3
4408 3
480 3
909 3
3501 3
4488 3
159 3
1258 3
47 3
2204 3
4125 3
220 3
470 3
849 3
4084 3
1626 3
3370 3
2842 3
4178 3
4217 3
1171 3
4549 3
3819 3
4158 3
1971 3
3440 3
2777 3
158 3
1815 3
2708 3
1214 3
1608 3
119 3
4183 3
441 3
4185 3
754 3
3520 3
3041 3
2988 3
478 3
2503 3
2473 3
684 3
1947 3
606 3
1464 3
301 3
970 3
2794 3
3398 3
749 3
1579 3
3009 3
399 3
2149 3
4460 3
1007 3
261 3
1886 3
4548 3
1621 3
4091 3
250 3
4386 3
2077 3
3176 3
3036 3
4429 3
3424 3
3042 3
2557 3
3872 3
2680 3
535 3
2754 3
2419 3
760 3
3054 3
630 3
1008 3
2098 3
388 3
3709 3
2889 3
272 3
1986 3
3813 3
1181 3
3733 3
2517 3
1887 3
3909 3
3986 3
4306 3
3880 3
4508 3
2151 3
2801 3
3507 3
3719 3
1994 3
914 3
214 3
3316 3
3993 3
4291 3
2521 3
266 3
4421 3
184 3
4072 3
4100 3
873 3
1117 3
2331 3
2563 3
3676 3
1085 3
4313 3
1549 3
3693 3
891 3
1046 3
4543 3
1681 3
2564 3
2421 3
4219 3
2139 3
2875 3
3758 3
2271 3
196 3
3190 3
1798 3
235 3
961 3
53 3
4469 3
2224 3
359 3
3312 3
2505 3
4052 3
93 3
2828 3
3851 3
1244 3
2269 3
851 3
879 3
2210 3
953 3
3121 3
4047 3
1962 3
2671 3
4030 3
4472 3
3205 3
3648 3
2328 3
38 3
2062 3
2308 3
2379 3
4109 3
2995 3
2747 3
907 3
1463 3
1915 3
2042 3
2408 3
2674 3
376 3
2788 3
3300 3
1880 3
4522 3
4163 3
324 3
3225 3
286 3
3890 3
3629 3
2099 3
486 3
910 3
3877 3
3623 3
2862 3
2592 3
2656 3
2148 3
1619 3
4275 3
1006 3
505 3
3326 3
2054 3
104 3
2822 3
3703 3
2767 3
1570 3
1840 3
4455 3
2088 3
1274 3
1358 3
2922 3
1767 3
375 3
539 3
790 3
1248 3
4113 3
134 3
1469 3
251 3
433 3
1249 3
3341 3
2418 3
2341 3
3420 3
4519 3
2638 3
4272 3
2913 3
3334 3
1089 3
4255 3
2551 3
2756 3
94 3
766 3
3484 3
4568 3
1576 3
1116 3
2793 3
60 3
1290 3
479 3
1195 3
3796 3
3750 3
1303 3
2539 3
896 3
688 3
1841 3
1568 3
781 3
553 3
542 3
4008 3
1471 3
3700 3
2080 3
3899 3
3712 3
4348 3
247 3
3075 3
413 3
1713 3
3074 3
1032 3
2194 3
687 3
4042 3
1607 3
3417 3
2356 3
2119 3
2827 3
1575 3
1394 3
3962 3
3953 3
481 3
2850 2
1378 2
3745 2
1304 2
2485 2
842 2
3923 2
801 2
639 2
3988 2
595 2
2435 2
2658 2
1068 2
3737 2
2890 2
2798 2
836 2
3498 2
1838 2
2470 2
3844 2
4271 2
4284 2
333 2
1917 2
2786 2
2375 2
2021 2
2790 2
3050 2
2378 2
84 2
1983 2
822 2
31 2
1849 2
1069 2
3157 2
3775 2
3760 2
2312 2
2516 2
4110 2
3250 2
2644 2
857 2
468 2
4 2
3065 2
3615 2
1772 2
3069 2
3770 2
3535 2
3793 2
245 2
2275 2
952 2
545 2
2879 2
1210 2
4239 2
2855 2
1306 2
950 2
4489 2
2370 2
3978 2
2400 2
229 2
3640 2
954 2
4509 2
102 2
2892 2
294 2
2432 2
3130 2
1795 2
3451 2
52 2
1725 2
2285 2
3073 2
792 2
2651 2
2593 2
407 2
1401 2
1502 2
3080 2
3759 2
1633 2
3397 2
262 2
675 2
1012 2
587 2
522 2
3407 2
627 2
1267 2
1458 2
463 2
90 2
180 2
3786 2
2181 2
2971 2
3567 2
3465 2
2947 2
3950 2
2659 2
3588 2
2550 2
2694 2
2191 2
4471 2
2211 2
157 2
1820 2
4101 2
2742 2
195 2
3936 2
436 2
1757 2
4222 2
4550 2
4225 2
745 2
1321 2
79 2
187 2
1285 2
501 2
2296 2
4523 2
2927 2
162 2
4420 2
4424 2
3788 2
3115 2
3458 2
2905 2
1859 2
3692 2
4546 2
3435 2
2184 2
3946 2
1544 2
2897 2
1604 2
1647 2
3746 2
2997 2
554 2
2462 2
3488 2
1687 2
1677 2
655 2
4482 2
550 2
1297 2
1424 2
4264 2
708 2
3630 2
3706 2
2396 2
3902 2
4473 2
1194 2
704 2
2103 2
490 2
1287 2
791 2
1746 2
2963 2
2324 2
4483 2
3026 2
3802 2
1963 2
926 2
2410 2
1707 2
19 2
608 2
3834 2
325 2
179 2
358 2
2967 2
1520 2
726 2
2627 2
2339 2
1396 2
4346 2
1280 2
802 2
4131 2
1448 2
171 2
4451 2
2351 2
4096 2
838 2
2097 2
2219 2
1314 2
3177 2
1508 2
3801 2
736 2
1558 2
814 2
3219 2
3590 2
3845 2
1398 2
1872 2
1447 2
3038 2
4360 2
895 2
1484 2
1657 2
973 2
2109 2
1581 2
3305 2
2110 2
4442 2
3173 2
4318 2
3873 2
4114 2
957 2
900 2
4038 2
1834 2
99 2
1912 2
2693 2
3189 2
2132 2
1680 2
4001 2
3707 2
2502 2
1554 2
1223 2
1237 2
1553 2
3663 2
300 2
1805 2
1879 2
3976 2
450 2
4295 2
1282 2
295 2
4412 2
230 2
1842 2
855 2
144 2
1950 2
3960 2
1745 2
3593 2
3188 2
3252 2
4294 2
312 2
1318 2
488 2
4541 2
4492 2
25 2
123 2
3855 2
2283 2
115 2
4554 2
3477 2
2417 2
598 2
3378 2
872 2
1632 2
3480 2
3699 2
3857 2
2588 2
3235 2
3677 2
589 2
2300 2
3597 2
4278 2
4004 2
2663 2
1042 2
2511 2
2836 2
924 2
1153 2
1120 2
402 2
503 2
713 2
4426 2
887 2
315 2
1648 2
1969 2
434 2
2978 2
1384 2
3886 2
2783 2
1496 2
1004 2
2610 2
701 2
4496 2
951 2
4086 2
2015 2
2607 2
689 2
3632 2
1819 2
1283 2
3392 2
64 2
834 2
1191 2
2280 2
334 2
3066 2
2546 2
2468 2
1631 2
3097 2
3195 2
3545 2
1206 2
1179 2
4559 2
3449 2
3781 2
3000 2
4556 2
442 2
2101 2
1429 2
3644 2
3234 2
3506 2
680 2
828 2
103 2
3346 2
34 2
1255 2
3468 2
2186 2
87 2
576 2
2108 2
326 2
813 2
2916 2
2973 2
1245 2
2116 2
2072 2
2386 2
1154 2
1104 2
2463 2
3141 2
3929 2
2247 2
672 2
2653 2
3864 2
3583 2
1560 2
3464 2
3489 2
1908 2
4497 2
3318 2
2528 2
1284 2
1785 2
4338 2
2733 2
4290 2
378 2
645 2
414 2
3783 2
4422 2
3102 2
199 2
2504 2
3436 2
1400 2
3209 2
3202 2
398 2
975 2
1091 2
3337 2
4443 2
2883 2
1789 2
1320 2
2129 2
1480 2
59 2
1407 2
2677 2
1379 2
270 2
1562 2
3240 2
594 2
1256 2
4067 2
3785 2
2909 2
4227 2
1997 2
3983 2
2434 2
4122 2
820 2
3336 2
4534 2
3143 2
2045 2
2531 2
2759 2
1397 2
282 2
3159 2
2085 2
331 2
2888 2
2246 2
2165 2
583 2
626 2
437 2
1263 2
15 2
3714 2
20 2
1391 2
2545 2
1433 2
3281 2
4372 2
4510 2
3302 2
4331 2
1901 2
1990 2
1060 2
2067 2
7 2
2403 2
2679 2
3086 2
2515 2
3881 2
2964 2
1945 2
3868 2
1196 2
3704 2
2055 2
1465 2
1293 2
4438 2
2766 2
1704 2
3166 2
2838 2
446 2
1538 2
3347 2
1714 2
3556 2
3879 2
2068 2
1268 2
2582 2
3324 2
4411 2
368 2
3196 2
1415 2
3514 2
788 2
1395 2
252 2
2268 2
712 2
2595 2
2928 2
3989 2
1670 2
174 2
3508 2
2652 2
2957 2
1895 2
2856 2
2092 2
2568 2
